import { type Content } from '../models/content'

export const contentsData = [
  {
    id:'526f5e69-e488-4e4c-ace2-a0084cc1e000',
    titleNo:2,
    title:"#2 理解するということ",
    contentText:"はじめに - トランプの関税政策1か月ほど前、トランプが世界各国に対して関税をかけるという発表があった日に、その日のS&P500の株価は前日比▲4.8%となり、24年9月ごろの水準に下落したという出来事があった。私はこのニュースを聞いたときに何が起きたのか正直よくわからなかった。関税をかけることによって他国の製品を自国に輸入しにくくなり、その結果景気が悪くなるということは何となく知っていたが、ではなぜトランプはこのタイミングで関税をかけることに決めたのか、教科書では関税は非効率と言われるにも関わらず関税をかけるのか、そもそもトランプが発表した関税政策は具体的にどの国に何％かけているのかといったことがまるで不明である。こういった疑問に回答するにはどのようなことを知る必要があるだろうか。ある人は経済学の教科書を購入して経済学の観点で貿易を一から勉強したり、ネットの解説記事を調べたり、あるいは知っている人に教えてもらうかもしれない。理解するときの感覚最近私は理解するということに興味がある。理解するという感覚はクイズを解く感覚に近く、理解することでクイズを解いたときの満足感を得られる。しかし、クイズと違って理解するというのは答えが基本的になく、理解したかどうかは自身の感覚次第である。私の場合では自分で調べて自分の言葉で説明できるくらいに読みこまないと理解したという状態にならず、学校の授業や会社の研修程度では到底理解することはできない。それは私の理解力が乏しいこともあると思うが、少なくとも私はほとんどのことがよくわかっていない。また、私は記憶力がよくなく、頑張って暗記しようとしてもなかなか頭に定着せずすぐ忘れてしまうので、暗記は私にとって理解する感覚とは離れている。一方で、歴史上の人物を答えたり、漢字テストように一問一等形式に強い方もいて、その方にとって理解するとは教科書に書かれている内容を頭の中に入れることだと思っているかもしれない。そう考えると理解するという感覚は人によって異なるのではないだろうか。",
    contentHtml:"<h2>はじめに - トランプの関税政策</h2><p>1か月ほど前、トランプが世界各国に対して関税をかけるという発表があった日に、その日のS&amp;P500の株価は前日比▲4.8%となり、24年9月ごろの水準に下落したという出来事があった。私はこのニュースを聞いたときに何が起きたのか正直よくわからなかった。関税をかけることによって他国の製品を自国に輸入しにくくなり、その結果景気が悪くなるということは何となく知っていたが、ではなぜトランプはこのタイミングで関税をかけることに決めたのか、教科書では関税は非効率と言われるにも関わらず関税をかけるのか、そもそもトランプが発表した関税政策は具体的にどの国に何％かけているのかといったことがまるで不明である。こういった疑問に回答するにはどのようなことを知る必要があるだろうか。ある人は経済学の教科書を購入して経済学の観点で貿易を一から勉強したり、ネットの解説記事を調べたり、あるいは知っている人に教えてもらうかもしれない。</p><h2>理解するときの感覚</h2><p>最近私は理解するということに興味がある。理解するという感覚はクイズを解く感覚に近く、理解することでクイズを解いたときの満足感を得られる。しかし、クイズと違って理解するというのは答えが基本的になく、理解したかどうかは自身の感覚次第である。私の場合では自分で調べて自分の言葉で説明できるくらいに読みこまないと理解したという状態にならず、学校の授業や会社の研修程度では到底理解することはできない。それは私の理解力が乏しいこともあると思うが、少なくとも私はほとんどのことがよくわかっていない。また、私は記憶力がよくなく、頑張って暗記しようとしてもなかなか頭に定着せずすぐ忘れてしまうので、暗記は私にとって理解する感覚とは離れている。一方で、歴史上の人物を答えたり、漢字テストように一問一等形式に強い方もいて、その方にとって理解するとは教科書に書かれている内容を頭の中に入れることだと思っているかもしれない。そう考えると理解するという感覚は人によって異なるのではないだろうか。</p>",
    imageUrl:"/contents/0002.jpg",
    price:200,
    category:"article",
    tags:["エッセイ"],
    publishDate:new Date(2025, 4, 17),
    noteUrl:"https://note.com/kenjinishizaki/n/nabaaf1c13191"
  } as Content,
  {
    id:'769eb42a-710c-4faa-98cb-78d21713b8ee',
    titleNo:1,
    title:"#1 原点に立ち戻る",
    contentText:"進むべき方向性がわからなくなったときに、原点に戻って考えるという手法がとられることがある。例えば、野球において投手が何を投げればわからなくなったときは、外角低めのストレートを投げることを戦後初の三冠王である野村克也さんが語っていた。",
    contentHtml:"<h2>はじめに-外角低めストレート</h1><p>進むべき方向性がわからなくなったときに、原点に戻って考えるという手法がとられることがある。例えば、野球において投手が何を投げればわからなくなったときは、外角低めのストレートを投げることを戦後初の三冠王である野村克也さんが語っていた。なぜ外角低めのストレートが原点なのかは不明だが、困ったら原点に戻るという考え方には私もならいたい。</p><p>私は今後どうやって生きていくかということに最近関心を持ち始めている。それは誰もが関心あることだと思うが、私の場合きっかけは今の生活を今後も続けられるのか想像できないからであった。私は大卒以降ITエンジニアのサラリーマンとして収入を得て日々暮らしている。サラリーマンの生活は始めた当初は業務に慣れなかったこともあり社会の厳しさを痛感していたが、30歳になるころには慣れてきて、今後について考える時間も生まれてきた。そこで考えたことはこれからは会社に頼らず自分自身の力で稼ぐ必要があるということであった。</p></div>",
    imageUrl:"/contents/0001.jpg",
    price:200,
    category:"article",
    tags:["初投稿"],
    publishDate:new Date(2025, 3, 4),
    noteUrl:"https://note.com/kenjinishizaki/n/n168c8e816312"
  } as Content,
  
];